In [1]:
from matplotlib import pyplot as plt
import numpy as np
import seaborn as sns
from sklearn.ensemble import RandomForestClassifier,BaggingClassifier,AdaBoostClassifier
from sklearn.metrics import accuracy_score
from sklearn import svm
import pandas as pd
import seaborn as sns
from sklearn.tree import DecisionTreeClassifier

In [38]:
X=pd.read_csv('train.csv')

In [39]:
X.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
y=X.pop('Survived')

In [41]:
X.drop(['PassengerId'],inplace=True,axis=1)

In [42]:
X.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
X['Sexy'] = X['Sex'].map({"male": 0, "female": 1})

In [44]:
X.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sexy
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [24]:
for dataset in X:
    X['Title'] = X['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

In [25]:

    
def change_title(x):
    if x=='Mr':
        return 0
    if x=='Mrs' or x=='Miss':
        return 1
    else:
        return 2
X['Title'] = X['Title'].apply(change_title)
X['Title'].describe()

count    891.000000
mean       0.494949
std        0.633101
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        2.000000
Name: Title, dtype: float64

In [402]:
X.Cabin.describe()

count     204
unique    147
top        G6
freq        4
Name: Cabin, dtype: object

In [403]:
def change_embark(x):
    if x=='S':
        return 0
    if x=='C':
        return 1
    if x=='Q':
        return 2
X['Embarked']=X['Embarked'].apply(change_embark)
X["Embarked"].fillna(X.Embarked.median(),inplace=True)
X["Embarked"].describe()

count    891.000000
mean       0.361392
std        0.635673
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        2.000000
Name: Embarked, dtype: float64

In [404]:
X.Cabin.describe()

count     204
unique    147
top        G6
freq        4
Name: Cabin, dtype: object

In [405]:
X.Ticket.describe()

count        891
unique       681
top       347082
freq           7
Name: Ticket, dtype: object

In [406]:
X['Cabin'].fillna('F',inplace=True)
def change_cab(x):
    if x[0]=='A':
        return 0
    if x[0]==('B'):
        return 1
    if x[0]==('C'):
        return 2
    if x[0]==('D'):
        return 3
    if x[0]==('E'):
        return 4
    if x[0]==('F'):
        return 5
    if x[0]==('G'):
        return 6
    if x[0]==('H'):
        return 7
    else: return 7
X['Cabin']=X['Cabin'].apply(change_cab)

In [407]:
X["Age"].fillna(X.Age.median(),inplace=True)
X["Age"].describe()

count    891.000000
mean      29.361582
std       13.019697
min        0.420000
25%       22.000000
50%       28.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [408]:
def change_sex(x):
    if x == 'male':
        return 1
    if x == 'female':
        return 0

X['Sex'] = X['Sex'].apply(change_sex)
X['Sex'].describe()

count    891.000000
mean       0.647587
std        0.477990
min        0.000000
25%        0.000000
50%        1.000000
75%        1.000000
max        1.000000
Name: Sex, dtype: float64

In [409]:
titles = set()
for name in X['Name']:
    titles.add(name.split(',')[1].split('.')[0].strip())

In [410]:
Title_Dictionary = {
    "Capt": "Officer",
    "Col": "Officer",
    "Major": "Officer",
    "Jonkheer": "Royalty",
    "Don": "Royalty",
    "Sir" : "Royalty",
    "Dr": "Officer",
    "Rev": "Officer",
    "the Countess":"Royalty",
    "Mme": "Mrs",
    "Mlle": "Miss",
    "Ms": "Mrs",
    "Mr" : "Mr",
    "Mrs" : "Mrs",
    "Miss" : "Miss",
    "Master" : "Master",
    "Lady" : "Royalty"
}

def get_titles():
    # we extract the title from each name
    X['Title'] = X['Name'].map(lambda name:name.split(',')[1].split('.')[0].strip())
    
    # a map of more aggregated title
    # we map each title
    X['Title'] = X.Title.map(Title_Dictionary)
    
    return X

In [411]:
X=get_titles()

In [412]:
def change_title(x):
    if x=='Mr':
        return 0
    if x=='Mrs' or x=='Miss':
        return 1
    if x=='Officer':
        return 2
    if x=='Royalty':
        return 3
    if x=='Master':
        return 4
X['Title'] = X['Title'].apply(change_title)
X['Title'].describe()

count    891.000000
mean       0.585859
std        0.925410
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        4.000000
Name: Title, dtype: float64

In [413]:
X['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [414]:
def change_fare(x):
    if x<=50:
        return 1
    if x>=50 and x<100:
        return 2
    if x>=100 and x<150:
        return 3
    else:
        return 4
X['Fare'] = X['Fare'].apply(change_fare)

In [415]:
X['Fare'].describe()

count    891.000000
mean       1.271605
std        0.668952
min        1.000000
25%        1.000000
50%        1.000000
75%        1.000000
max        4.000000
Name: Fare, dtype: float64

In [416]:
def change_ticket(x):
    if x[0]=='1' or x[0]=='2' or x[0]=='4' or x[0]=='3' or x[0]=='5' or x[0]=='6' or x[0]=='7' or x[0]=='8' or x[0]=='9' and len(x)==5:
        return 0
    if x[0]=='1' or x[0]=='2' or x[0]=='4' or x[0]=='3' or x[0]=='5' or x[0]=='6' or x[0]=='7' or x[0]=='8' or x[0]=='9' and len(x)==4:
        return 10
    if x[0]=='1' or x[0]=='2' or x[0]=='4' or x[0]=='3' or x[0]=='5' or x[0]=='6' or x[0]=='7' or x[0]=='8' or x[0]=='9' and len(x)>5:
        return 11
    if x[0]=='A':
        return 1
    if x[0]=='B':
        return 2
    if x[0]=='C':
        return 3
    if x[0]=='D':
        return 4
    if x[0]=='S' and x[1]=='C':
        return 5
    if x[0]=='P' and x[1]=='P':
        return 6
    if x[0]=='P' and x[1]=='C':
        return 7
    if x[0]=='S' and x[1]=='T':
        return 8
    else:
        return 9
X['Ticket']=X['Ticket'].apply(change_ticket)
X['Ticket'].head()

0    1
1    7
2    8
3    0
4    0
Name: Ticket, dtype: int64

In [417]:
def change_age(x):
    if x<=5:
        return 0
    if x>5 and x<=10:
        return 1
    if x>10 and x<=15:
        return 2
    if x>15 and x<=18:
        return 3
    else:
        return 4
X['Age'] = X['Age'].apply(change_age)

In [418]:
a="1234"
len(a)

4

In [419]:
#X['SibSp']=X['SibSp']+X['Parch']+1
#X.drop(['Parch'],inplace=True,axis=1)

In [420]:
#def change_sib(x):
 #   if x==1:
  #      return 0
   # if x in (2,3):
    #    return 2
    #else:
     #   return 3
#X['SibSp']=X['SibSp'].apply(change_sib)
#X['SibSp'].describe()

In [421]:
numeric_variables=list(X.dtypes[X.dtypes!="object"].index)
X[numeric_variables].head()

   Pclass  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked  Title
0       3    1    4      1      0       1     1      5       0.0      0
1       1    0    4      1      0       7     2      2       1.0      1
2       3    0    4      0      0       8     1      5       0.0      1
3       1    0    4      1      0       0     2      2       0.0      1
4       3    1    4      0      0       0     1      5       0.0      0

In [422]:
X[numeric_variables].describe()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
count,891.000000,891.000000,891.00000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,2.308642,0.647587,3.62963,0.523008,0.381594,1.529742,1.271605,4.402918,0.361392,0.585859
std,0.836071,0.477990,1.00212,1.102743,0.806057,2.959647,0.668952,1.303561,0.635673,0.925410
min,1.000000,0.000000,0.00000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,2.000000,0.000000,4.00000,0.000000,0.000000,0.000000,1.000000,5.000000,0.000000,0.000000
50%,3.000000,1.000000,4.00000,0.000000,0.000000,0.000000,1.000000,5.000000,0.000000,0.000000
75%,3.000000,1.000000,4.00000,1.000000,0.000000,1.000000,1.000000,5.000000,1.000000,1.000000
max,3.000000,1.000000,4.00000,8.000000,6.000000,10.000000,4.000000,7.000000,2.000000,4.000000

In [423]:
model2=RandomForestClassifier(n_estimators=100)
model2.fit(X[numeric_variables],y)
model2.score(X[numeric_variables],y)

0.90123456790123457

In [424]:
model3=BaggingClassifier(DecisionTreeClassifier(),max_features=1,n_estimators=20)
model3.fit(X[numeric_variables],y)
model3.score(X[numeric_variables],y)

0.70594837261503929

In [425]:
model4=AdaBoostClassifier(DecisionTreeClassifier(),n_estimators=10,learning_rate=1)
model4.fit(X[numeric_variables],y)
model4.score(X[numeric_variables],y)

0.90123456790123457

In [426]:
dt=DecisionTreeClassifier()

In [427]:
dt.fit(X[numeric_variables],y)
dt.score(X[numeric_variables],y)

0.90123456790123457

In [428]:
model=svm.SVC(kernel='linear')
model.fit(X[numeric_variables],y)
model.score(X[numeric_variables],y)

0.81818181818181823

In [429]:
test=pd.read_csv('test.csv')

In [430]:
test.shape

(418, 11)

In [431]:
y1=test.pop('PassengerId')
y1.shape

(418,)

In [432]:

test['Sex'] = test['Sex'].apply(change_sex)

test.describe()

           Pclass         Sex         Age       SibSp       Parch        Fare
count  418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean     2.265550    0.636364   30.272590    0.447368    0.392344   35.627188
std      0.841838    0.481622   14.181209    0.896760    0.981429   55.907576
min      1.000000    0.000000    0.170000    0.000000    0.000000    0.000000
25%      1.000000    0.000000   21.000000    0.000000    0.000000    7.895800
50%      3.000000    1.000000   27.000000    0.000000    0.000000   14.454200
75%      3.000000    1.000000   39.000000    1.000000    0.000000   31.500000
max      3.000000    1.000000   76.000000    8.000000    9.000000  512.329200

In [433]:
test['Embarked']=test['Embarked'].apply(change_embark)
test["Embarked"].fillna(test.Embarked.median(),inplace=True)
test["Age"].fillna(test.Age.median(),inplace=True)
test["Age"].describe()
test['Cabin'].fillna('F',inplace=True)
test['Cabin']=test['Cabin'].apply(change_cab)

In [434]:
test['Age']=test['Age'].apply(change_age)

In [435]:
test.describe()

,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
count,418.000000,418.000000,418.000000,418.000000,418.000000,417.000000,418.000000,418.000000
mean,2.265550,0.636364,3.712919,0.447368,0.392344,35.627188,4.411483,0.464115
std,0.841838,0.481622,0.861584,0.896760,0.981429,55.907576,1.291203,0.685516
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,0.000000,4.000000,0.000000,0.000000,7.895800,5.000000,0.000000
50%,3.000000,1.000000,4.000000,0.000000,0.000000,14.454200,5.000000,0.000000
75%,3.000000,1.000000,4.000000,1.000000,0.000000,31.500000,5.000000,1.000000
max,3.000000,1.000000,4.000000,8.000000,9.000000,512.329200,6.000000,2.000000

In [436]:
titles_ = set()
for name in test['Name']:
    titles_.add(name.split(',')[1].split('.')[0].strip())
test.shape

(418, 10)

In [437]:
Title_Dictionary_ = {
    "Capt": "Officer",
    "Col": "Officer",
    "Major": "Officer",
    "Jonkheer": "Royalty",
    "Don": "Royalty",
    "Sir" : "Royalty",
    "Dr": "Officer",
    "Rev": "Officer",
    "the Countess":"Royalty",
    "Mme": "Mrs",
    "Mlle": "Miss",
    "Ms": "Mrs",
    "Mr" : "Mr",
    "Mrs" : "Mrs",
    "Miss" : "Miss",
    "Master" : "Master",
    "Lady" : "Royalty"
}

def get_titles_():
    # we extract the title from each name
    test['Title'] = test['Name'].map(lambda name:name.split(',')[1].split('.')[0].strip())
    
    # a map of more aggregated title
    # we map each title
    test['Title'] = test.Title.map(Title_Dictionary_)
    
    return test

In [438]:
test=get_titles_()
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,3,"Kelly, Mr. James",1,4,0,0,330911,7.8292,5,2,Mr
1,3,"Wilkes, Mrs. James (Ellen Needs)",0,4,1,0,363272,7.0000,5,0,Mrs
2,2,"Myles, Mr. Thomas Francis",1,4,0,0,240276,9.6875,5,2,Mr
3,3,"Wirz, Mr. Albert",1,4,0,0,315154,8.6625,5,0,Mr
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,4,1,1,3101298,12.2875,5,0,Mrs

In [439]:




test['Title'] = test['Title'].apply(change_title)
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,3,"Kelly, Mr. James",1,4,0,0,330911,7.8292,5,2,0.0
1,3,"Wilkes, Mrs. James (Ellen Needs)",0,4,1,0,363272,7.0000,5,0,1.0
2,2,"Myles, Mr. Thomas Francis",1,4,0,0,240276,9.6875,5,2,0.0
3,3,"Wirz, Mr. Albert",1,4,0,0,315154,8.6625,5,0,0.0
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,4,1,1,3101298,12.2875,5,0,1.0

In [440]:
test['Fare'] = test['Fare'].apply(change_fare)    


test.shape

(418, 11)

In [441]:
test["Title"].fillna(test.Title.median(),inplace=True)
test["Fare"].fillna(test.Fare.median(),inplace=True)

In [442]:
#test['SibSp']=test['SibSp']+test['Parch']+1
#test.drop(['Parch'],inplace=True,axis=1)
#test['SibSp'].apply(change_sib)

In [443]:
test['Ticket']=test['Ticket'].apply(change_ticket)
test['Ticket'].head()

0    0
1    0
2    0
3    0
4    0
Name: Ticket, dtype: int64

In [444]:
test[numeric_variables].describe()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
count,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000
mean,2.265550,0.636364,3.712919,0.447368,0.392344,1.686603,1.325359,4.411483,0.464115,0.586124
std,0.841838,0.481622,0.861584,0.896760,0.981429,3.012343,0.770797,1.291203,0.685516,0.933521
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,1.000000,0.000000,4.000000,0.000000,0.000000,0.000000,1.000000,5.000000,0.000000,0.000000
50%,3.000000,1.000000,4.000000,0.000000,0.000000,0.000000,1.000000,5.000000,0.000000,0.000000
75%,3.000000,1.000000,4.000000,1.000000,0.000000,3.000000,1.000000,5.000000,1.000000,1.000000
max,3.000000,1.000000,4.000000,8.000000,9.000000,10.000000,4.000000,6.000000,2.000000,4.000000

In [445]:
y_pred=model2.predict(test[numeric_variables])
len(y_pred)

418

In [344]:
y_pred=model3.predict(test[numeric_variables])
len(y_pred)

418

In [451]:
y_pred=model4.predict(test[numeric_variables])
len(y_pred)

418

In [449]:
y_pred=dt.predict(test[numeric_variables])
len(y_pred)

418

In [447]:
y_pred=model.predict(test[numeric_variables])
len(y_pred)

418

In [452]:
submission=pd.DataFrame({"PassengerId":y1,"Survived":y_pred})
submission.to_csv('titanic12.csv',index=False)
len(submission)

418